Hello! Thank you quick reply.

Let me emphasize that in my config `b_end` i stoward Megaport Port, not MVE. With vlan towards MVE I also have no issues.

When I create from scratch i see in plan that provider even not try to assign `ordered_vlan = 300` for `b_end`, but for `a_end` `inner_vlan` is being assigned correctly in plan.
```
# megaport_vxc.ipxgrx[0] will be created
  + resource "megaport_vxc" "ipxgrx" {
      + a_end                = {
          + current_product_uid   = (known after apply)
          + inner_vlan            = 200
          + location              = (known after apply)
          + location_id           = (known after apply)
          + ordered_vlan          = (known after apply)
          + owner_uid             = (known after apply)
          + product_name          = (known after apply)
          + requested_product_uid = (known after apply)
          + secondary_name        = (known after apply)
          + vlan                  = (known after apply)
          + vnic_index            = 1
        }
      + admin_locked         = (known after apply)
      + attribute_tags       = (known after apply)
      + b_end                = {
          + current_product_uid   = (known after apply)
          + inner_vlan            = (known after apply)
          + location              = (known after apply)
          + location_id           = (known after apply)
          + ordered_vlan          = (known after apply)
          + owner_uid             = (known after apply)
          + product_name          = (known after apply)
          + requested_product_uid = (known after apply)
          + secondary_name        = (known after apply)
          + vlan                  = (known after apply)
          + vnic_index            = (known after apply)
        }
      + cancelable           = (known after apply)
      + company_name         = (known after apply)
      + company_uid          = (known after apply)
      + contract_end_date    = (known after apply)
      + contract_start_date  = (known after apply)
      + contract_term_months = 1
      + cost_centre          = "A-1019-2024-GER -230-1012"
      + create_date          = (known after apply)
      + created_by           = (known after apply)
      + csp_connections      = (known after apply)
      + distance_band        = (known after apply)
      + last_updated         = (known after apply)
      + live_date            = (known after apply)
      + locked               = (known after apply)
      + product_id           = (known after apply)
      + product_name         = "TEST-LBO-EU-Frankfurt-ICSS-IPXGRX-VXC"
      + product_type         = (known after apply)
      + product_uid          = (known after apply)
      + provisioning_status  = (known after apply)
      + rate_limit           = 100
      + secondary_name       = (known after apply)
      + service_id           = (known after apply)
      + shutdown             = (known after apply)
      + usage_algorithm      = (known after apply)
```
